{"classes":["STREET","CITY","PROVINCE","POSTAL"],"annotations":[["TD Canada Trust Gift Letter To: The Manager TD Canada Trust ‘This is to continn that the undersigned is making a pilt of $‘To: AMANINDER SINGH HAJRAH Name (s): SIMRATPANNU Relationship: SISTER Relationship: ee Property To Be Purchased: Street : 30 GOLDEN SPRINGS DRIVE City: BRAMPTON Prov; ONTARIO postal Code: LTA 4N4 No part of the gill is being provided by any Third Party having anv interest (direct or indirect) in the sale of the subjeet property. ‘The monev is a genuine gift and does not have to be repaid.",{"entities":[[273,296,"STREET"],[303,311,"CITY"],[319,326,"PROVINCE"],[340,347,"POSTAL"]]}],["TD Canada Trust Gift Letter To: The Manager TD Canada Trust ‘This is to continn that the undersigned is making a pilt of $‘To: PREETINDER SINGH HAZRAH Name (s): SONIA SINGH Relationship: SISTER Relationship: ee Property To Be Purchased: Street : 1 RICHMOND ST W City: TORONTO Prov; ONTARIO postal Code: M1W 4J1 No part of the gill is being provided by any Third Party having anv interest (direct or indirect) in the sale of the subjeet property. ‘The monev is a genuine gift and does not have to be repaid.",{"entities":[[274,289,"STREET"],[296,303,"CITY"],[311,318,"PROVINCE"],[332,339,"POSTAL"]]}],["TD Canada Trust Gift Letter To: The Manager TD Canada Trust ‘This is to continn that the undersigned is making a pilt of $‘To: JIWANJOT BAJWA Name (s): PARAMJOT SINGH Relationship: BROTHER Relationship: ee Property To Be Purchased: Street : 100 ADELAIDE STREET City: TORONTO Prov; ONTARIO postal Code: M1N 2W2 No part of the gill is being provided by any Third Party having anv interest (direct or indirect) in the sale of the subjeet property. ‘The monev is a genuine gift and does not have to be repaid.",{"entities":[[269,288,"STREET"],[295,302,"CITY"],[310,317,"PROVINCE"],[331,338,"POSTAL"]]}],["TD Canada Trust Gift Letter To: The Manager TD Canada Trust ‘This is to continn that the undersigned is making a pilt of $‘To: ROBERT LAU Name (s): RICHARD LEE Relationship: FATHER Relationship: ee Property To Be Purchased: Street : 3975 GRAND PARK DR City: MISSISSAUGA Prov; ONTARIO postal Code: L8A 4J1 No part of the gill is being provided by any Third Party having anv interest (direct or indirect) in the sale of the subjeet property. ‘The monev is a genuine gift and does not have to be repaid.",{"entities":[[261,279,"STREET"],[286,297,"CITY"],[305,312,"PROVINCE"],[326,333,"POSTAL"]]}],["TD Canada Trust Gift Letter To: The Manager TD Canada Trust ‘This is to continn that the undersigned is making a pilt of $‘To: RICKY SINGH Name (s): PREET SINGH Relationship: BROTHER Relationship: ee Property To Be Purchased: Street : 574/8 KAHNUWAN ROAD City: NORTH YORK Prov; ONTARIO postal Code: LTA 4N8 No part of the gill is being provided by any Third Party having anv interest (direct or indirect) in the sale of the subjeet property. ‘The monev is a genuine gift and does not have to be repaid.",{"entities":[[263,282,"STREET"],[289,299,"CITY"],[307,314,"PROVINCE"],[328,335,"POSTAL"]]}],["TD Canada Trust Gift Letter To: The Manager TD Canada Trust ‘This is to continn that the undersigned is making a pilt of $‘To: JASBIR SINGH BAJWA Name (s): NEELAMJIT KAUR Relationship: SISTER Relationship: ee Property To Be Purchased: Street : 6011 167A AVE City: EDMONTON Prov; ALBERTA postal Code: T6W7J4 No part of the gill is being provided by any Third Party having anv interest (direct or indirect) in the sale of the subjeet property. ‘The monev is a genuine gift and does not have to be repaid.",{"entities":[[272,285,"STREET"],[292,300,"CITY"],[308,315,"PROVINCE"],[329,335,"POSTAL"]]}],["TD Canada Trust Gift Letter To: The Manager TD Canada Trust ‘This is to continn that the undersigned is making a pilt of $‘To: MICHAEL Name (s): NANCY DREW Relationship: SPOUSE Relationship: ee Property To Be Purchased: Street : 332 GOLDEN AVE City: WINNIPEG Prov; MANITOBA postal Code: L79 4N9 No part of the gill is being provided by any Third Party having anv interest (direct or indirect) in the sale of the subjeet property. ‘The monev is a genuine gift and does not have to be repaid.",{"entities":[[257,271,"STREET"],[278,286,"CITY"],[294,302,"PROVINCE"],[316,323,"POSTAL"]]}]]}